{"Timestamp": "Timestamp", "Score": "Score", "What is your age in years?": "demo_age", "What gender do you identify as?": "demo_gender", "What race(s) do you identify with?": "demo_race", "If you selected \"Other\", please specify below. If not, please leave this question blank.": "demo_race_other", "Are you an international or domestic student?": "demo_domestic", "What is your primary language?": "demo_primary_lang", "How many languages are you fluent in? (Include your primary language to the count)": "demo_num_lang", "Which language class are you currently taking?": "demo_class", "How many years have you been learning/utilizing your learned language?": "demo_years_learning", "Do you speak this learned language at home?": "demo_home_speaker", "Is this learned language spoken in your home?": "demo_home_spoken", "What learning strategies do you utilize to learn the language? [Attending Class]": "engage_attend_class", "What learning strategies do you utilize to learn the language? [Participating in Class]": "engage_participate_class", "What learning strategies do you utilize to learn the language? [Apps or Software]": "engage_apps", "What learning strategies do you utilize to learn the language? [Practicing with other Individuals]": "engage_practice_others", "What learning strategies do you utilize to learn the language? [Listening to Audio Material]": "engage_listen", "What learning strategies do you utilize to learn the language? [Reading Books or Articles]": "engage_read", "What learning strategies do you utilize to learn the language? [Watching movies or TV shows]": "engage_watch", "In the last 30 days, how many times have you held a short conversation (~1-5 min) with someone outside of class in your learned language?": "use_short_conv", "In the last 30 days, how many times have you read something outside of class responsibilities in your learned language?": "use_read", "In the last 30 days, how many times have you watched/listened to something outside of class responsibilities in your learned language?": "use_watch", "In the last 30 days, how many times have you gone out of your way to interact with others using your learned language?": "use_interact", "In the last 30 days, how many times have you come across an opportunity to use your learned language in your daily life?": "use_opportunity_use", "Do you use Duolingo or any other application for your learned language?": "use_duolingo", "In the last 30 days, how many times have you used this application?": "use_duolingo_usage", "How much do you agree with the statement, \"I have not learned enough to use my learned language.\"": "feel_not_learned_enough", "How much do you agree with the statement, \"I have learned enough to hold small conversations with native speakers.\"": "feel_small_conversations", "How much do you agree with the statement, \"I have learned enough to hold adequate conversations with native speakers.\"": "feel_adequate_conversations", "How much do you agree with the statement, \"I have learned enough to be considered fluent.\"": "feel_considered_fluent", "How much would you agree with the statement, \"I would like to continue learning this language.\"": "feel_continue_learning", "How much would you agree with the statement, \"I would like to continue learning my learned language within a structured environment.\"": "feel_continue_structured", "How much do you agree with the statement, \"I want to become certified fluent within my learned language.\"": "feel_certified_fluent", "How comfortable are you speaking your learned language?": "feel_comfortable_speaking", "How comfortable are you reading in your learned language?": "feel_comfortable_reading", "How comfortable are you writing in your learned language?": "feel_comfortable_writing", "How comfortable are you understanding your learned language when spoken by others?": "feel_comfortable_listening", "What grade do you currently have in the class?": "feel_current_grade", "What is your expected grade in this class?": "feel_expected_grade", "Why are you learning your learned language? (Please rank in order from strongest to weakest motivator) [Family]": "rank_family", "Why are you learning your learned language? (Please rank in order from strongest to weakest motivator) [Media Consumption]": "rank_media", "Why are you learning your learned language? (Please rank in order from strongest to weakest motivator) [General Education]": "rank_education", "Why are you learning your learned language? (Please rank in order from strongest to weakest motivator) [Cultural Appreciation]": "rank_culture", "Why are you learning your learned language? (Please rank in order from strongest to weakest motivator) [Self-Improvement]": "rank_improvement", "Why are you learning your learned language? (Please rank in order from strongest to weakest motivator) [Global Citizenship]": "rank_citizenship", "Why are you learning your learned language? (Please rank in order from strongest to weakest motivator) [Other]": "rank_other", "If you placed \"Other\" higher than 7th place for the previous question, please specify here:": "rank_other_text", "I wish I could speak many foreign languages perfectly.": "motivator_speak", "Learning my learned language is really great.": "motivator_great", "I would get nervous if I had to speak my learned language to a stranger.": "motivator_nervous", "I make a point of trying to understand all of the learned language that I see and hear.": "motivator_understand", "Studying my learned language is important because I will need it for my career.": "motivator_career", "I wish I could read newspapers and magazines in many foreign languages.": "motivator_newspapers", "Studying my learned language is important because it will allow me to meet and converse with more and varied people.": "motivator_converse", "I have a strong desire to know all aspects of my learned language.": "motivator_aspects", "Studying my learned language is important because it will make me more educated.": "motivator_educated", "I wish I could have many friends who natively speak my learned language.": "motivator_friends", "I would really like to learn many foreign languages.": "motivator_many", "My family have stressed the importance my learned language will have for me when I leave school.": "motivator_family_stressed", "Studying my learned language is important because it will enable me to better understand and appreciate their cultural way of life.": "motivator_understand_cultural", "My family feel that I should continue studying my learned language all through school.": "motivator_family_continue", "My family feel that it is very important for me to learn my learned language.": "motivator_family_important", "I want to learn my learned language so well that it will become natural to me.": "motivator_natural", "Studying my learned language is important because it will be useful in getting a good job.": "motivator_job", "Studying my learned language is important because I will be able to interact more easily with other speakers.": "motivator_interact", "I wish I were fluent in my learned language.": "motivator_fluent", "I would rather see a TV program in its own language than dubbed into my primary language.": "motivator_tv", "I often find instances where I wish I could read my learned language.": "motivator_read", "I feel like I am required to take my language class.": "motivator_required", "If given the opportunity to choose, I would not learn my learned language again.": "motivator_choose_not", "If given the opportunity to choose, I would learn my learned language again.": "motivator_choose", "I find my learned language difficult to learn.": "motivator_difficult", "My motivation to learn my learned language in order to communicate with other speakers is:": "motivator_communicate", "My motivation to learn my learned language for practical purposes (e.g., to get a good job) is:": "motivator_practical", "My family encourage me to learn my learned language:": "motivator_family_encourage", "Extra Credit sign in: Please select the class you are currently taking if eligible for extra credit": "ec_class", "Extra Credit Sign In: Please type in your student ID if you are extra credit eligible. This information is solely for your instructor to identify who has completed the survey for extra credit.": "ec_id"}